#+title: SQLite in the browser
#+subtitle: pushing everything to the client
#+tags[]: deno, sqlite, browser, static_sites, wasm
#+date: 2021-04-15
#+aliases[]: /articles/2021/sq_lite_in_the_browser

I'm getting more interested in SQLite as a database, keeping
everything in memory to the process itself.  When do we actually need
to have a multi-process solution for a website?  How much can we
really do within a single process?

One type of architecture I'm exploring is to have a zillion little
sqlite files that are shipped around as needed, rather than providing
an API to parse them out have one way where we can generate a bunch of
effectively static assets of the structured data and then having the
visualization happen on the client side.  Let's look at two JavaScript
examples that let that all happen in the browser.

Both of these use wasm to ship the actually sqlite binary code and run
in in browser!

** Installing deno

I used =asdf=, but you can [[https://deno.land/#installation][follow the official instructions]].

#+begin_src bash
  asdf plugin add deno
  asdf install deno latest
#+end_src

And then check to see what you have installed:

#+begin_src bash :results output
deno --version
#+end_src

#+RESULTS:
: deno 1.8.3 (release, x86_64-unknown-linux-gnu)
: v8 9.0.257.3
: typescript 4.2.2

